var holidayData = {
  1: {
    1: 'ראש השנה',
    3: 'צום גדליה',
    10: 'יום הכיפורים',
    15: 'סוכות - חג ראשון',
    16: 'חול המועד סוכות א',
    17: 'חול המועד סוכות ב',
    18: 'חול המועד סוכות ג',
    19: 'חול המועד סוכות ד',
    20: 'חול המועד סוכות ה',
    21: 'הושענא רבא',
    22: 'שמיני עצרת/שמחת תורה'
  },
  3: {
    25: 'חנוכה - נר ראשון',
    26: 'חנוכה - נר שני',
    27: 'חנוכה - נר שלישי',
    28: 'חנוכה - נר רביעי',
    29: 'חנוכה - נר חמישי',
    30: 'חנוכה - נר שישי',
  },
  4: {
    10: 'עשרה בטבת'
  },
  5: {
    15: 'ט"ו בשבת'
  },
  7: {
    13: 'תענית אסתר',
    14: 'פורים',
    15: 'שושן פורים'
  },
  8: {
    14: 'ערב פסח',
    15: 'פסח',
    16: 'חול המועד פסח א',
    17: 'חול המועד פסח ב',
    18: 'חול המועד פסח ג',
    19: 'חול המועד פסח ד',
    20: 'חול המועד פסח ה',
    21: 'שביעי של פסח',
    27: 'יום הזיכרון לשואה ולגבורה'
  },
  9: {
    4: 'יום הזיכרון לחללי צה"ל',
    5: 'יום העצמאות',
    28: 'יום ירושלים'
  },
  10: {
    6: 'שבועות'
  },
  11: {
    17: 'שבעה עשר בתמוז'
  },
  12: {
    9: 'תשעה באב'
  }
};
var coordinates = {
  'תל אביב': {
    'latitude': 32.08088,
    'longitude': 34.78057,
  },
  'ירושלים': {
    'latitude': 31.7648,
    'longitude': 35.2137,
  },
  'אילת': {
    'latitude': 29.5577,
    'longitude': 34.9519,
  },
  'חיפה': {
    'latitude': 32.7940,
    'longitude': 34.9896,
  },
}
/* 
  Sixteen year configurations, represented by 3-4 characters.
  For char 1 and 3:
  a = sunday
  b = monday
  c = tuesday
  e = thursday
  s = saturday

  For char 2:
  m = miss (חסר)
  f = full (שלם)
  n = normal (כסדרו)

  Direct translation:
  bmc = בחג
  bfe = בשה
  cne = גכה
  ens = הכז
  efa = השא
  sma = זחא
  sfc = זשג
  bme = בחה
  bfs = בשז
  cns = גכז
  ema = החא
  efc = השג
  smc = זחג
  sfe = זשה
  */
const parashot = {
  "bmc": {
    1: {
      27: "בראשית",
    },
    2: {
      4: "נח",
      11: "לך לך",
      18: "וירא",
      25: "חיי שרה"
    },
    3: {
      3: "תולדת",
      10: "ויצא",
      17: "וישלח",
      24: "וישב"
    },
    4: {
      2: "מקץ",
      9: "ויגש",
      16: "ויחי",
      23: "שמות"
    },
    5: {
      1: "וארא",
      8: "בא",
      15: "בשלח",
      22: "יתרו",
      29: "משפטים"
    },
    7: { 
      6: "תרומה",
      13: "תצוה",
      20: "כי תשא",
      27: "ויקהל"
    },
    8: {
      5: "ויקרא",
      12: "צו",
      26: "שמיני"
    },
    9: {
      3: "תזריע",
      10: "אחרי מות",
      17: "אמר",
      24: "בהר"
    },
    10: {
      2: "במדבר",
      9: "נשא",
      16: "בהעלתך",
      23: "שלח",
      30: "קרח"
    },
    11: {
      7: "חקת",
      14: "בלק",
      21: "פינחס",
      28: "מטות"
    },
    12: {
      6: "דברים",
      13: "ואתחנן",
      20: "עקב",
      27: "ראה"
    },
    13: {
      4: "שפטים",
      11: "כי תצא",
      18: "כי תבא",
      25: "נצבים"
    },
    14: {  
      6: "וילך",
      13: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "bfe": {
    1: {
      27: "בראשית"
    },
    2: {
      4: "נח",
      11: "לך לך",
      18: "וירא",
      25: "חיי שרה"
    },
    3: {
      2: "תולדת",
      9: "ויצא",
      16: "וישלח",
      23: "וישב",
      30: "מקץ"
    },
    4: {
      7: "ויגש",
      14: "ויחי",
      21: "שמות",
      28: "וארא"
    },
    5: {
      6: "בא",
      13: "בשלח",
      20: "יתרו",
      27: "משפטים"
    },
    7: {
      4: "תרומה",
      11: "תצוה",
      18: "כי תשא",
      25: "ויקהל-פקדי"
    },
    8: {
      3: "ויקרא",
      10: "צו",
      24: "שמיני"
    },
    9: {
      1: "תזריע-מצרע",
      8: "אחרי מות-קדשים",
      15: "אמר",
      22: "בהר-בחקתי",
      29: "במדבר"
    },
    10: {
      7: "נשא",
      14: "בהעלתך",
      21: "שלח",
      28: "קרח"
    },
    11: {
      5: "חקת",
      12: "בלק",
      19: "פינחס",
      26: "מטות-מסעי"
    },
    12: {
      4: "דברים",
      11: "ואתחנן",
      18: "עקב",
      25: "ראה"
    },
    13: {
      2: "שפטים",
      9: "כי תצא",
      16: "כי תבא",
      23: "נצבים-וילך"
    },
    14: {
      6: "וילך",
      13: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "cne": {
    1: {
      26: "בראשית"
    },
    2: {
      3: "נח",
      10: "לך לך",
      17: "וירא",
      24: "חיי שרה"
    },
    3: {
      2: "תולדת",
      9: "ויצא",
      16: "וישלח",
      23: "וישב",
      30: "מקץ"
    },
    4: {
      7: "ויגש",
      14: "ויחי",
      21: "שמות",
      28: "וארא"
    },
    5: {
      6: "בא",
      13: "בשלח",
      20: "יתרו",
      27: "משפטים"
    },
    7: {
      4: "תרומה",
      11: "תצוה",
      18: "כי תשא",
      25: "ויקהל-פקדי"
    },
    8: {
      3: "ויקרא",
      10: "צו",
      24: "שמיני"
    },
    9: {
      1: "תזריע-מצרע",
      8: "אחרי מות-קדשים",
      15: "אמר",
      22: "בהר-בחקתי",
      29: "במדבר"
    },
    10: {
      7: "נשא",
      14: "בהעלתך",
      21: "שלח",
      28: "קרח"
    },
    11: {
      5: "חקת",
      12: "בלק",
      19: "פינחס",
      26: "מטות-מסעי"
    },
    12: {
      4: "דברים",
      11: "ואתחנן",
      18: "עקב",
      25: "ראה"
    },
    13: {
      2: "שפטים",
      9: "כי תצא",
      16: "כי תבא",
      23: "נצבים"
    },
    14: {
      5: "וילך",
      12: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "ens": {
    1: {
      24: "בראשית"
    },
    2: {
      1: "נח",
      8: "לך לך",
      15: "וירא",
      22: "חיי שרה",
      29: "תולדת"
    },
    3: {
      7: "ויצא",
      14: "וישלח",
      21: "וישב",
      28: "מקץ"
    },
    4: {
      5: "ויגש",
      12: "ויחי",
      19: "שמות",
      26: "וארא"
    },
    5: {
      4: "בא",
      11: "בשלח",
      18: "יתרו",
      25: "משפטים"
    },
    7: {
      2: "תרומה",
      9: "תצוה",
      16: "כי תשא",
      23: "ויקהל-פקדי"
    },
    8: {
      1: "ויקרא",
      8: "צו",
      22: "שמיני",
      29: "תזריע-מצרע"
    },
    9: {
      6: "אחרי מות-קדשים",
      13: "אמר",
      20: "בהר",
      27: "בחקתי"
    },
    10: {
      5: "במדבר",
      12: "נשא",
      19: "בהעלתך",
      26: "שלח"
    },
    11: {
      3: "קרח",
      10: "חקת",
      17: "בלק",
      24: "פינחס"
    },
    12: {
      2: "מטות-מסעי",
      9: "דברים",
      16: "ואתחנן",
      23: "עקב",
      30: "ראה"
    },
    13: {
      7: "שפטים",
      14: "כי תצא",
      21: "כי תבא",
      28: "נצבים"
    },
    14: {
      6: "וילך",
      13: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "efa": {
    1: {
      24: "בראשית"
    },
    2: {
      1: "נח",
      8: "לך לך",
      15: "וירא",
      22: "חיי שרה",
      29: "תולדת"
    },
    3: {
      6: "ויצא",
      13: "וישלח",
      20: "וישב",
      27: "מקץ"
    },
    4: {
      4: "ויגש",
      11: "ויחי",
      18: "שמות",
      25: "וארא"
    },
    5: {
      3: "בא",
      10: "בשלח",
      17: "יתרו",
      24: "משפטים"
    },
    7: {
      1: "תרומה",
      8: "תצוה",
      15: "כי תשא",
      22: "ויקהל",
      29: "פקדי"
    },
    8: {
      7: "ויקרא",
      14: "צו",
      28: "שמיני"
    },
    9: {
      5: "תזריע-מצרע",
      12: "אחרי מות-קדשים",
      19: "אמר",
      26: "בהר-בחקתי"
    },
    10: {
      4: "במדבר",
      11: "נשא",
      18: "בהעלתך",
      25: "שלח"
    },
    11: {
      2: "קרח",
      9: "חקת",
      16: "בלק",
      23: "פינחס"
    },
    12: {
      1: "מטות-מסעי",
      8: "דברים",
      15: "ואתחנן",
      22: "עקב",
      29: "ראה"
    },
    13: {
      6: "שפטים",
      13: "כי תצא",
      20: "כי תבא",
      27: "נצבים"
    },
    14: {
      5: "וילך",
      12: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "sma": {
    1: {
      29: "בראשית"
    },
    2: {
      6: "נח",
      13: "לך לך",
      20: "וירא",
      27: "חיי שרה"
    },
    3: {
      5: "תולדת",
      12: "ויצא",
      19: "וישלח",
      26: "וישב"
    },
    4: {
      4: "מקץ",
      11: "ויגש",
      18: "ויחי",
      25: "שמות"
    },
    5: {
      3: "וארא",
      10: "בא",
      17: "בשלח",
      24: "יתרו"
    },
    7: {
      1: "משפטים",
      8: "תרומה",
      15: "תצוה",
      22: "כי תשא",
      29: "ויקהל-פקדי"
    },
    8: {
      7: "ויקרא",
      14: "צו",
      28: "שמיני"
    },
    9: {
      5: "תזריע-מצרע",
      12: "אחרי מות-קדשים",
      19: "אמר",
      26: "בהר-בחקתי"
    },
    10: {
      4: "במדבר",
      11: "נשא",
      18: "בהעלתך",
      25: "שלח"
    },
    11: {
      2: "קרח",
      9: "חקת",
      16: "בלק",
      23: "פינחס"
    },
    12: {
      1: "מטות-מסעי",
      8: "דברים",
      15: "ואתחנן",
      22: "עקב",
      29: "ראה"
    },
    13: {
      6: "שפטים",
      13: "כי תצא",
      20: "כי תבא",
      27: "נצבים"
    },
    14: {
      8: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "sfc": {
    1: {
      29: "בראשית"
    },
    2: {
      6: "נח",
      13: "לך לך",
      20: "וירא",
      27: "חיי שרה"
    },
    3: {
      4: "תולדת",
      11: "ויצא",
      18: "וישלח",
      25: "וישב"
    },
    4: {
      2: "מקץ",
      9: "ויגש",
      16: "ויחי",
      23: "שמות"
    },
    5: {
      1: "וארא",
      8: "בא",
      15: "בשלח",
      22: "יתרו",
      29: "משפטים"
    },
    7: {
      6: "תרומה",
      13: "תצוה",
      20: "כי תשא",
      27: "ויקהל-פקדי"
    },
    8: {
      5: "ויקרא",
      12: "צו",
      26: "שמיני"
    },
    9: {
      3: "תזריע-מצרע",
      10: "אחרי מות-קדשים",
      17: "אמר",
      24: "בהר-בחקתי"
    },
    10: {
      2: "במדבר",
      9: "נשא",
      16: "בהעלתך",
      23: "שלח",
      30: "קרח"
    },
    11: {
      7: "חקת",
      14: "בלק",
      21: "פינחס",
      28: "מטות-מסעי"
    },
    12: {
      6: "דברים",
      13: "ואתחנן",
      20: "עקב",
      27: "ראה"
    },
    13: {
      4: "שפטים",
      11: "כי תצא",
      18: "כי תבא",
      25: "נצבים-וילך"
    },
    14: {
      8: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "bme": {
    1: {
      27: "בראשית"
    },
    2: {
      4: "נח",
      11: "לך לך",
      18: "וירא",
      25: "חיי שרה"
    },
    3: {
      3: "תולדת",
      10: "ויצא",
      17: "וישלח",
      24: "וישב"
    },
    4: {
      2: "מקץ",
      9: "ויגש",
      16: "ויחי",
      23: "שמות"
    },
    5: {
      1: "וארא",
      8: "בא",
      15: "בשלח",
      22: "יתרו",
      29: "משפטים"
    },
    6: {
      6: "תרומה",
      13: "תצוה",
      20: "כי תשא",
      27: "ויקהל"
    },
    7: {
      4: "פקדי",
      11: "ויקרא",
      18: "צו",
      25: "שמיני"
    },
    8: {
      3: "תזריע",
      10: "מצרע",
      24: "אחרי מות"
    },
    9: {
      1: "קדשים",
      8: "אמר",
      15: "בהר",
      22: "בחקתי",
      29: "במדבר"
    },
    10: {
      7: "נשא",
      14: "בהעלתך",
      21: "שלח",
      28: "קרח"
    },
    11: {
      5: "חקת",
      12: "בלק",
      19: "פינחס",
      26: "מטות-מסעי"
    },
    12: {
      4: "דברים",
      11: "ואתחנן",
      18: "עקב",
      25: "ראה"
    },
    13: {
      2: "שפטים",
      9: "כי תצא",
      16: "כי תבא",
      23: "נצבים"
    },
    14: {
      6: "וילך",
      13: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "bfs": {
    1: {
      27: "בראשית"
    },
    2: {
      4: "נח",
      11: "לך לך",
      18: "וירא",
      25: "חיי שרה"
    },
    3: {
      2: "תולדת",
      9: "ויצא",
      16: "וישלח",
      23: "וישב",
      30: "מקץ"
    },
    4: {
      7: "ויגש",
      14: "ויחי",
      21: "שמות",
      28: "וארא"
    },
    5: {
      6: "בא",
      13: "בשלח",
      20: "יתרו",
      27: "משפטים"
    },
    6: {
      4: "תרומה",
      11: "תצוה",
      18: "כי תשא",
      25: "ויקהל"
    },
    7: {
      2: "פקדי",
      9: "ויקרא",
      16: "צו",
      23: "שמיני"
    },
    8: {
      1: "תזריע",
      8: "מצרע",
      22: "אחרי מות",
      29: "קדשים"
    },
    9: {
      6: "אמר",
      13: "בהר",
      20: "בחקתי",
      27: "במדבר"
    },
    10: {
      5: "נשא",
      12: "בהעלתך",
      19: "שלח",
      26: "קרח"
    },
    11: {
      3: "חקת",
      10: "בלק",
      17: "פינחס",
      24: "מטות"
    },
    12: {
      2: "מסעי",
      9: "דברים",
      16: "ואתחנן",
      23: "עקב",
      30: "ראה"
    },
    13: {
      7: "שפטים",
      14: "כי תצא",
      21: "כי תבא",
      28: "נצבים"
    },
    14: {
      6: "וילך",
      13: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "cns": {
    1: {
      26: "בראשית"
    },
    2: {
      3: "נח",
      10: "לך לך",
      17: "וירא",
      24: "חיי שרה"
    },
    3: {
      2: "תולדת",
      9: "ויצא",
      16: "וישלח",
      23: "וישב",
      30: "מקץ"
    },
    4: {
      7: "ויגש",
      14: "ויחי",
      21: "שמות",
      28: "וארא"
    },
    5: {
      6: "בא",
      13: "בשלח",
      20: "יתרו",
      27: "משפטים"
    },
    6: {
      4: "תרומה",
      11: "תצוה",
      18: "כי תשא",
      25: "ויקהל"
    },
    7: {
      2: "פקודי",
      9: "ויקרא",
      16: "צו",
      23: "שמיני"
    },
    8: {
      1: "תזריע",
      8: "מצרע",
      22: "אחרי מות",
      29: "קדשים"
    },
    9: {
      6: "אמר",
      13: "בהר",
      20: "בחקתי",
      27: "במדבר"
    },
    10: {
      5: "נשא",
      12: "בהעלתך",
      19: "שלח",
      26: "קרח"
    },
    11: {
      3: "חקת",
      10: "בלק",
      17: "פינחס",
      24: "מטות"
    },
    12: {
      2: "מסעי",
      9: "דברים",
      16: "ואתחנן",
      23: "עקב",
      30: "ראה"
    },
    13: {
      7: "שפטים",
      14: "כי תצא",
      21: "כי תבא",
      28: "נצבים"
    },
    14: {
      5: "וילך",
      12: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "ema": {
    1: {
      24: "בראשית"
    },
    2: {
      1: "נח",
      8: "לך לך",
      15: "וירא",
      22: "חיי שרה",
      29: "תולדת"
    },
    3: {
      7: "ויצא",
      14: "וישלח",
      21: "וישב",
      28: "מקץ"
    },
    4: {
      6: "ויגש",
      13: "ויחי",
      20: "שמות",
      27: "וארא"
    },
    5: {
      5: "בא",
      12: "בשלח",
      19: "יתרו",
      26: "משפטים"
    },
    6: {
      3: "תרומה",
      10: "תצוה",
      17: "כי תשא",
      24: "ויקהל"
    },
    7: {
      1: "פקדי",
      8: "ויקרא",
      15: "צו",
      22: "שמיני",
      29: "תזריע"
    },
    8: {
      7: "מצרע",
      14: "אחרי מות",
      28: "קדשים"
    },
    9: {
      5: "אמר",
      12: "בהר",
      19: "בחקתי",
      26: "במדבר"
    },
    10: {
      4: "נשא",
      11: "בהעלתך",
      18: "שלח",
      25: "קרח"
    },
    11: {
      2: "חקת",
      9: "בלק",
      16: "פינחס",
      23: "מטות"
    },
    12: {
      1: "מסעי",
      8: "דברים",
      15: "ואתחנן",
      22: "עקב",
      29: "ראה"
    },
    13: {
      6: "שפטים",
      13: "כי תצא",
      20: "כי תבא",
      27: "נצבים"
    },
    14: {
      3: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "efc": {
    1: {
      24: "בראשית"
    },
    2: {
      1: "נח",
      8: "לך לך",
      15: "וירא",
      22: "חיי שרה",
      29: "תולדת"
    },
    3: {
      6: "ויצא",
      13: "וישלח",
      20: "וישב",
      27: "מקץ"
    },
    4: {
      4: "ויגש",
      11: "ויחי",
      18: "שמות",
      25: "וארא"
    },
    5: {
      3: "בא",
      10: "בשלח",
      17: "יתרו",
      24: "משפטים"
    },
    6: {
      1: "תרומה",
      8: "תצוה",
      15: "כי תשא",
      22: "ויקהל",
      29: "פקדי"
    },
    7: {
      6: "ויקרא",
      13: "צו",
      20: "שמיני",
      27: "תזריע"
    },
    8: {
      5: "מצרע",
      12: "אחרי מות",
      26: "קדשים"
    },
    9: {
      3: "אמר",
      10: "בהר",
      17: "בחקתי",
      24: "במדבר"
    },
    10: {
      2: "נשא",
      9: "בהעלתך",
      16: "שלח",
      23: "קרח",
      30: "חקת"
    },
    11: {
      7: "בלק",
      14: "פינחס",
      21: "מטות",
      28: "מסעי"
    },
    12: {
      6: "דברים",
      13: "ואתחנן",
      20: "עקב",
      27: "ראה"
    },
    13: {
      4: "שפטים",
      11: "כי תצא",
      18: "כי תבא",
      25: "נצבים-וילך"
    },
    14: {
      3: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "smc": {
    1: {
      29: "בראשית"
    },
    2: {
      6: "נח",
      13: "לך לך",
      20: "וירא",
      27: "חיי שרה"
    },
    3: {
      5: "תולדת",
      12: "ויצא",
      19: "וישלח",
      26: "וישב"
    },
    4: {
      4: "מקץ",
      11: "ויגש",
      18: "ויחי",
      25: "שמות"
    },
    5: {
      3: "וארא",
      10: "בא",
      17: "בשלח",
      24: "יתרו"
    },
    6: {
      1: "משפטים",
      8: "תרומה",
      15: "תצוה",
      22: "כי תשא",
      29: "ויקהל"
    },
    7: {
      6: "פקדי",
      13: "ויקרא",
      20: "צו",
      27: "שמיני"
    },
    8: {
      5: "תזריע",
      12: "מצרע",
      26: "אחרי מות"
    },
    9: {
      3: "קדשים",
      10: "אמר",
      17: "בהר",
      24: "בחקתי"
    },
    10: {
      2: "במדבר",
      9: "נשא",
      16: "בהעלתך",
      23: "שלח",
      30: "קרח"
    },
    11: {
      7: "חקת",
      14: "בלק",
      21: "פינחס",
      28: "מטות-מסעי"
    },
    12: {
      6: "דברים",
      13: "ואתחנן",
      20: "עקב",
      27: "ראה"
    },
    13: {
      4: "שפטים",
      11: "כי תצא",
      18: "כי תבא",
      25: "נצבים-וילך"
    },
    14: {
      8: "האזינו",
      22: "וזאת הברכה"
    }
  },
  "sfe": {
    1: {
      29: "בראשית"
    },
    2: {
      6: "נח",
      13: "לך לך",
      20: "וירא",
      27: "חיי שרה"
    },
    3: {
      4: "תולדת",
      11: "ויצא",
      18: "וישלח",
      25: "וישב"
    },
    4: {
      2: "מקץ",
      9: "ויגש",
      16: "ויחי",
      23: "שמות"
    },
    5: {
      1: "וארא",
      8: "בא",
      15: "בשלח",
      22: "יתרו",
      29: "משפטים"
    },
    6: {
      6: "תרומה",
      13: "תצוה",
      20: "כי תשא",
      27: "ויקהל"
    },
    7: {
      4: "פקדי",
      11: "ויקרא",
      18: "צו",
      25: "שמיני"
    },
    8: {
      3: "תזריע",
      10: "מצרע",
      24: "אחרי מות"
    },
    9: {
      1: "קדשים",
      8: "אמר",
      15: "בהר",
      22: "בחקתי",
      29: "במדבר"
    },
    10: {
      7: "נשא",
      14: "בהעלתך",
      21: "שלח",
      28: "קרח"
    },
    11: {
      5: "חקת",
      12: "בלק",
      19: "פינחס",
      26: "מטות-מסעי"
    },
    12: {
      4: "דברים",
      11: "ואתחנן",
      18: "עקב",
      25: "ראה"
    },
    13: {
      2: "שפטים",
      9: "כי תצא",
      16: "כי תבא",
      23: "נצבים-וילך"
    },
    14: {
      8: "האזינו",
      22: "וזאת הברכה"
    }
  }
};
